In [5]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
8 rows affected.

[('information_schema',),
 ('manipal',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sqlalchemy',),
 ('sys',),
 ('world',)]

In [6]:
# ================================================================================================================

In [7]:
                    # SINGLE ROW FUNCTIONS !!

In [8]:
# ================================================================================================================

In [9]:
%%sql
use manipal;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
0 rows affected.

[]

In [10]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[('employee',)]

In [11]:
%%sql
select * from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[(1, 'Sheldon', 'Cooper', 'Senior Software Engineer', datetime.date(2020, 11, 23), 'Apartment 4q,Pasadena Apartments ,California', 70000),
 (2, 'Howard', 'Wolowitz', 'Senior Software Engineer', datetime.date(2020, 11, 23), 'Apartment 2b,omega apartments ,California', 70000),
 (3, 'Leonard', 'Hofstadter', 'IT security Engineer', datetime.date(2020, 12, 12), 'Apartment 4b,sunshine apartments ,California', 60000),
 (4, 'Bernadette', 'richards', 'HR Manager', datetime.date(2020, 3, 10), 'Apartment 7,long island apartments ,California', 100000),
 (5, 'Rust', 'Cohle', 'Security Audit Head', datetime.date(2020, 3, 10), 'Apartment 9b,Long island apartments ,California', 120000),
 (6, 'Thomas', 'Shelby', 'Senior Software Engineer', datetime.date(2020, 11, 23), 'Apartment 3c,fox apartments ,California', 70000)]

In [12]:
# ================================================================================================================

In [13]:
# SINGLE ROW FUNCTION == [ CHARACTER ]

In [14]:

# ================================================================================================================

In [15]:
%%sql
select CONCAT(first_name,last_name,designation) from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('SheldonCooperSenior Software Engineer',),
 ('HowardWolowitzSenior Software Engineer',),
 ('LeonardHofstadterIT security Engineer',),
 ('BernadetterichardsHR Manager',),
 ('RustCohleSecurity Audit Head',),
 ('ThomasShelbySenior Software Engineer',)]

In [16]:
%%sql
select LENGTH(first_name),last_name from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[(7, 'Cooper'),
 (6, 'Wolowitz'),
 (7, 'Hofstadter'),
 (10, 'richards'),
 (4, 'Cohle'),
 (6, 'Shelby')]

In [17]:
%%sql
SELECT SUBSTRING(first_name,1,5) FROM employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('Sheld',), ('Howar',), ('Leona',), ('Berna',), ('Rust',), ('Thoma',)]

In [18]:
%%sql
SELECT INSTR(first_name,"a") from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[(0,), (4,), (5,), (5,), (0,), (5,)]

In [19]:
%%sql
select LPAD(first_name,12,"*"), last_name from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('*****Sheldon', 'Cooper'),
 ('******Howard', 'Wolowitz'),
 ('*****Leonard', 'Hofstadter'),
 ('**Bernadette', 'richards'),
 ('********Rust', 'Cohle'),
 ('******Thomas', 'Shelby')]

In [20]:
%%sql
select RPAD(first_name,12,"*"), last_name from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('Sheldon*****', 'Cooper'),
 ('Howard******', 'Wolowitz'),
 ('Leonard*****', 'Hofstadter'),
 ('Bernadette**', 'richards'),
 ('Rust********', 'Cohle'),
 ('Thomas******', 'Shelby')]

In [21]:
%%sql
select TRIM('Sh' FROM first_name) from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('eldon',),
 ('Howard',),
 ('Leonard',),
 ('Bernadette',),
 ('Rust',),
 ('Thomas',)]

In [22]:
%%sql
select REPLACE(first_name,'H','C') from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('Sheldon',),
 ('Coward',),
 ('Leonard',),
 ('Bernadette',),
 ('Rust',),
 ('Thomas',)]

In [23]:
# ================================================================================================================

In [24]:
# SINGLE ROW FUNCTION == [ CASE  CONVERSION ]

In [25]:
# ================================================================================================================

In [26]:
%%sql
select UPPER(first_name),last_name from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('SHELDON', 'Cooper'),
 ('HOWARD', 'Wolowitz'),
 ('LEONARD', 'Hofstadter'),
 ('BERNADETTE', 'richards'),
 ('RUST', 'Cohle'),
 ('THOMAS', 'Shelby')]

In [27]:
%%sql
select LOWER(first_name),last_name from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
6 rows affected.

[('sheldon', 'Cooper'),
 ('howard', 'Wolowitz'),
 ('leonard', 'Hofstadter'),
 ('bernadette', 'richards'),
 ('rust', 'Cohle'),
 ('thomas', 'Shelby')]

In [28]:
# ================================================================================================================

In [29]:
# SINGLE ROW FUNCTION == [ DATE FUNCTION ]

In [30]:
# ================================================================================================================

In [31]:
%%sql
SELECT DAY("2021-07-28");

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(28,)]

In [32]:
%%sql
SELECT MONTH("2021-07-28");

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(7,)]

In [33]:
%%sql
SELECT YEAR("2021-07-28");

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(2021,)]

In [34]:
%%sql
SELECT LAST_DAY("2021-07-1");

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(datetime.date(2021, 7, 31),)]

In [35]:
%%sql
select CURRENT_DATE();

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(datetime.date(2021, 7, 29),)]

In [36]:
%%sql
SELECT ADDDATE("2021-07-28", INTERVAL 10 YEAR);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[('2031-07-28',)]

In [37]:
%%sql
SELECT ADDDATE("2021-07-28", INTERVAL 10 MONTH);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[('2022-05-28',)]

In [38]:
%%sql
SELECT ADDDATE("2021-07-28", INTERVAL 10 DAY);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[('2021-08-07',)]

In [39]:
# ================================================================================================================

In [40]:
# SINGLE ROW FUNCTION == [ NUMBER ]

In [41]:
# ================================================================================================================

In [42]:
%%sql
select MAX(salary)from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(120000,)]

In [43]:
%%sql
select MIN(salary)from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(60000,)]

In [44]:
%%sql
select POWER(2,7);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(128.0,)]

In [45]:
%%sql
select SIGN(120);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(1,)]

In [46]:
%%sql
select SIGN(-120);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(-1,)]

In [47]:
%%sql
select SIGN(0);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(0,)]

In [48]:
%%sql
select TRUNCATE(120.552,3);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(Decimal('120.552'),)]

In [49]:
%%sql
select TRUNCATE(120.552,1);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(Decimal('120.5'),)]

In [50]:
%%sql
select TRUNCATE(120.552,0);

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(Decimal('120'),)]

In [51]:
%%sql
select SUM(salary) from employee;

 * mysql+mysqlconnector://root:***@localhost:3306/sqlalchemy
1 rows affected.

[(Decimal('490000'),)]